# IsRuleEnabled Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..IsRuleEnabled Method (Int32)
PerformanceAdviser Class See Also
---
Retrieves an enabled/disabled status for the given rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsRuleEnabled(
	int index
)
```

Visual Basic
---
```text
Public Function IsRuleEnabled ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsRuleEnabled(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The rule index to retrieve enabled/disabled status for.
# ### Return Value
True if rule is disabled, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The index is outside of acceptable range. |

# See Also
PerformanceAdviser Class
IsRuleEnabled Overload
Autodesk.Revit.DB Namespace